In [1]:
import pandas as pd

In [8]:
df = pd.read_csv('dataset/sea_levels_2015.csv', parse_dates=['Time'])

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1608 entries, 0 to 1607
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Time              1608 non-null   object
 1   GMSL              1608 non-null   float64
 2   GMSL uncertainty  1608 non-null   float64
dtypes: float64(2), object(1)
memory usage: 37.8+ KB

In [22]:
df['Year'] = pd.DatetimeIndex(df['Time']).year

In [23]:
df.groupby('Year', as_index=False).mean()

            GMSL  GMSL uncertainty
Year
1880 -158.725000         24.200000
1881 -153.058333         24.200000
1882 -169.883333         23.008333
1883 -164.591667         22.800000
1884 -143.750000         22.200000
...          ...               ...
2009   58.016667          6.883333
2010   65.750000          7.116667
2011   67.300000          7.550000
2012   76.083333          8.300000
2013   67.725000          8.841667

[134 rows x 2 columns]